# Pandas
4. GroupBy

In [1]:
import numpy as np
import pandas as pd

In [4]:
data = { 'company':['goog','goog','msft','msft','fb','fb'],
        'person':['sam','charlie','amy','vanessa','carl','sarah'],
        'sales':[200,120,340,124,243,350]
       }

In [5]:
df = pd.DataFrame(data)

In [6]:
df

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      amy    340
3    msft  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [7]:
df.groupby('company')

In [8]:
bycom = df.groupby('company')

In [9]:
bycom.mean()

         sales
company
fb       296.5
goog     160.0
msft     232.0

In [11]:
bycom.sum()

         sales
company
fb         593
goog       320
msft       464

In [12]:
bycom.std()

              sales
company
fb        75.660426
goog      56.568542
msft     152.735065

In [13]:
bycom.sum().loc['fb']

sales    593
Name: fb, dtype: int64

In [14]:
df.groupby('company').sum().loc['fb']

sales    593
Name: fb, dtype: int64

In [15]:
df.groupby('company').count()

         person  sales
company
fb            2      2
goog          2      2
msft          2      2

In [16]:
df.groupby('company').max()

          person  sales
company
fb         sarah    350
goog         sam    200
msft     vanessa    340

In [17]:
df.groupby('company').min()

          person  sales
company
fb          carl    243
goog     charlie    120
msft         amy    124

In [18]:
df.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [19]:
df.groupby('company').describe().transpose()

company              fb        goog        msft
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [20]:
df.groupby('company').describe().transpose()['fb']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: fb, dtype: float64

In [27]:
df.groupby('company').describe().loc['fb']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: fb, dtype: float64